# Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь вводит натуральное число N – количество элементов в массиве и число, которое необходимо проверить - X.
# Заполните массив случайными натуральными числами от 1 до N.
# Выведите, ближайший к X элемент. Если есть несколько элементов, которые равноудалены от X, выведите наименьший по величине.
# Ввод: 10
# Ввод: 7
# 1 2 1 8 9 6 5 4 3 4
# Вывод: 6
from random import randint

n = int(input("Введите кол-во элементо: "))
list_1 = [randint(1, n) for _ in range(n)]
print(*list_1)

x = int(input("введите X: "))
closest = list_1[0]
for el in list_1[1:]:
    if abs(el - x) < abs(closest - x):
        closest = el
    elif abs(el - x) == abs(closest - x):
        if el < closest:
            closest = el
print(closest)