# Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь вводит натуральное число N – количество элементов в массиве и число, которое необходимо проверить - X.
# Заполните массив случайными натуральными числами от 1 до N/2.
# Выведите, сколько раз X встречается в массиве.
# Ввод: 5
# Ввод: 1
# 1 2 1 2 2
# Вывод: 2
from os import system
system("cls")
from random import randint
n = int(input("Введите кол-во элементов: "))
list_1 = [randint(0, n//2) for _ in range(n)]
print(*list_1)

x = int(input("Введите число которое нужно проверить: "))
counter = 0
for el in list_1:
    if el == x:
        counter += 1
print(counter)